<!-- terraform-plan-comment:root:default -->
### Terraform Plan

<details><summary>🟢 <strong>create</strong> <code>3</code> · 🟡 <strong>update</strong> <code>0</code> · 🔴 <strong>destroy</strong> <code>3</code></summary>

<details><summary>State refresh</summary>

```
random_password.db: Refreshing state... [id=none]
aws_cloudwatch_log_group.world: Refreshing state... [id=/ecs/azerothcore/worldserver]
aws_secretsmanager_secret.db: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:628639830692:secret:azerothcore-db-credentials-VkU5uq]
data.aws_iam_openid_connect_provider.github_actions: Reading...
aws_cloudwatch_log_group.auth: Refreshing state... [id=/ecs/azerothcore/authserver]
aws_cloudwatch_log_group.db_import: Refreshing state... [id=/ecs/azerothcore/db-import]
aws_cloudwatch_log_group.mysql_admin: Refreshing state... [id=/ecs/azerothcore/mysql-admin]
aws_iam_role.ecs_task_execution: Refreshing state... [id=azerothcore-ecs-exec]
aws_efs_file_system.data: Refreshing state... [id=fs-0151ee886af0a4fe7]
aws_vpc.this: Refreshing state... [id=vpc-0733436d37aa8894e]
data.aws_caller_identity.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=628639830692]
aws_iam_policy.github_actions_terraform_plan: Refreshing state... [id=arn:aws:iam::628639830692:policy/wow-infra-github-terraform-plan]
aws_cloudwatch_log_group.client_data: Refreshing state... [id=/ecs/azerothcore/client-data]
aws_ecs_cluster.this: Refreshing state... [id=arn:aws:ecs:us-east-2:628639830692:cluster/azerothcore-cluster]
aws_secretsmanager_secret.docker_registry: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:628639830692:secret:azerothcore-docker-registry-credentials-be9JyO]
aws_iam_policy.github_actions_terraform_apply: Refreshing state... [id=arn:aws:iam::628639830692:policy/wow-infra-github-terraform-apply]
data.aws_iam_openid_connect_provider.github_actions: Read complete after 0s [id=arn:aws:iam::628639830692:oidc-provider/token.actions.githubusercontent.com]
aws_iam_role.github_actions_terraform_plan: Refreshing state... [id=wow-infra-github-terraform-plan]
aws_iam_role.github_actions_terraform_apply: Refreshing state... [id=wow-infra-github-terraform-apply]
aws_iam_policy.secrets: Refreshing state... [id=arn:aws:iam::628639830692:policy/azerothcore-secrets]
aws_iam_role_policy_attachment.ecs_exec: Refreshing state... [id=azerothcore-ecs-exec-20260311141803147300000003]
aws_ecs_task_definition.auth: Refreshing state... [id=azerothcore-authserver]
aws_ecs_task_definition.client_data: Refreshing state... [id=azerothcore-client-data]
aws_ecs_task_definition.db_import: Refreshing state... [id=azerothcore-db-import]
aws_ecs_task_definition.world: Refreshing state... [id=azerothcore-worldserver]
aws_iam_role_policy_attachment.secrets: Refreshing state... [id=azerothcore-ecs-exec-20260311141803518900000004]
aws_iam_role_policy_attachment.github_actions_terraform_plan: Refreshing state... [id=wow-infra-github-terraform-plan-20260311144742260900000001]
aws_iam_role_policy_attachment.github_actions_terraform_apply: Refreshing state... [id=wow-infra-github-terraform-apply/arn:aws:iam::628639830692:policy/wow-infra-github-terraform-apply]
aws_subnet.public["0"]: Refreshing state... [id=subnet-0559addc778f5b81f]
aws_internet_gateway.this: Refreshing state... [id=igw-00a3d0912f436824e]
aws_subnet.private["1"]: Refreshing state... [id=subnet-081a078b66ca44241]
aws_lb_target_group.auth: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:628639830692:targetgroup/azerothcore-auth/c06b619bea23f095]
aws_security_group.ecs: Refreshing state... [id=sg-0159ae9f4de3957c4]
aws_route_table.public: Refreshing state... [id=rtb-026e9852d265e0caf]
aws_lb_target_group.world: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:628639830692:targetgroup/azerothcore-world/32878e7e3a748703]
aws_subnet.public["1"]: Refreshing state... [id=subnet-067a7cd1de630dff6]
aws_subnet.private["0"]: Refreshing state... [id=subnet-04889fae6e65e051b]
aws_security_group.rds: Refreshing state... [id=sg-0a9f8debc480c9364]
aws_security_group.efs: Refreshing state... [id=sg-0ad9aa9aad5b5d0c2]
aws_route.public_internet: Refreshing state... [id=r-rtb-026e9852d265e0caf1080289494]
aws_db_subnet_group.this: Refreshing state... [id=azerothcore-db]
aws_route_table.private["0"]: Refreshing state... [id=rtb-093483fa7d2ed2ac8]
aws_route_table.private["1"]: Refreshing state... [id=rtb-0269110b706b4ed08]
aws_efs_mount_target.data["0"]: Refreshing state... [id=fsmt-0afb5650eca292cdc]
aws_efs_mount_target.data["1"]: Refreshing state... [id=fsmt-0e98207faa725fc8d]
aws_route_table_association.public["0"]: Refreshing state... [id=rtbassoc-0ef810789bcc77238]
aws_eip.nat["0"]: Refreshing state... [id=eipalloc-03669ee5ce553c2bc]
aws_lb.nlb: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:628639830692:loadbalancer/net/azerothcore-nlb/081b0befe3cfb6df]
aws_route_table_association.public["1"]: Refreshing state... [id=rtbassoc-0aaae5ab65badfebb]
aws_eip.nat["1"]: Refreshing state... [id=eipalloc-0e50bc52ebe8ba4d1]
aws_route_table_association.private["1"]: Refreshing state... [id=rtbassoc-05af529978a855ecb]
aws_route_table_association.private["0"]: Refreshing state... [id=rtbassoc-0e0b51162b4215262]
aws_lb_listener.auth: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:628639830692:listener/net/azerothcore-nlb/081b0befe3cfb6df/aecf3551b00b9050]
aws_lb_listener.world: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-2:628639830692:listener/net/azerothcore-nlb/081b0befe3cfb6df/7ca18a3c785d5092]
aws_db_instance.this: Refreshing state... [id=db-M2U3ECYUAVWMT64S6KKBDCRQPA]
aws_nat_gateway.this["1"]: Refreshing state... [id=nat-0e9a311fdd0037119]
aws_nat_gateway.this["0"]: Refreshing state... [id=nat-0e544adacde537e53]
aws_route.private_nat["0"]: Refreshing state... [id=r-rtb-093483fa7d2ed2ac81080289494]
aws_route.private_nat["1"]: Refreshing state... [id=r-rtb-0269110b706b4ed081080289494]
aws_secretsmanager_secret_version.db: Refreshing state... [id=arn:aws:secretsmanager:us-east-2:628639830692:secret:azerothcore-db-credentials-VkU5uq|terraform-20260311203052588200000001]
aws_ecs_task_definition.mysql_admin: Refreshing state... [id=azerothcore-mysql-admin]
aws_ecs_service.auth: Refreshing state... [id=arn:aws:ecs:us-east-2:628639830692:service/azerothcore-cluster/azerothcore-authserver]
aws_ecs_service.world: Refreshing state... [id=arn:aws:ecs:us-east-2:628639830692:service/azerothcore-cluster/azerothcore-worldserver]
```
</details>

```terraform
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_db_instance.this must be replaced
-/+ resource "aws_db_instance" "this" {
      ~ address                               = "azerothcore-mysql.creesw04kf8v.us-east-2.rds.amazonaws.com" -> (known after apply)
      ~ arn                                   = "arn:aws:rds:us-east-2:628639830692:db:azerothcore-mysql" -> (known after apply)
      ~ availability_zone                     = "us-east-2a" -> (known after apply)
      ~ backup_retention_period               = 0 -> (known after apply)
      ~ backup_target                         = "region" -> (known after apply)
      ~ backup_window                         = "06:06-06:36" -> (known after apply)
      ~ ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
      + character_set_name                    = (known after apply)
      ~ copy_tags_to_snapshot                 = false -> true
      - customer_owned_ip_enabled             = false -> null
      ~ database_insights_mode                = "standard" -> (known after apply)
      ~ deletion_protection                   = false -> true
      - domain_dns_ips                        = [] -> null
      + domain_fqdn                           = (known after apply)
      - enabled_cloudwatch_logs_exports       = [] -> null
      ~ endpoint                              = "azerothcore-mysql.creesw04kf8v.us-east-2.rds.amazonaws.com:3306" -> (known after apply)
      ~ engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
      ~ engine_version_actual                 = "8.4.7" -> (known after apply)
      + final_snapshot_identifier             = "azerothcore-mysql-final"
      ~ hosted_zone_id                        = "Z2XHWR1WZ565X2" -> (known after apply)
      - iam_database_authentication_enabled   = false -> null
      ~ id                                    = "db-M2U3ECYUAVWMT64S6KKBDCRQPA" -> (known after apply)
      + identifier_prefix                     = (known after apply)
      ~ iops                                  = 0 -> (known after apply)
      + kms_key_id                            = (known after apply)
      + latest_restorable_time                = (known after apply)
      ~ license_model                         = "general-public-license" -> (known after apply)
      ~ listener_endpoint                     = [] -> (known after apply)
      ~ maintenance_window                    = "fri:08:53-fri:09:23" -> (known after apply)
      ~ master_user_secret                    = [] -> (known after apply)
      + master_user_secret_kms_key_id         = (known after apply)
      - max_allocated_storage                 = 0 -> null
      + monitoring_role_arn                   = (known after apply)
      + nchar_character_set_name              = (known after apply)
      ~ network_type                          = "IPV4" -> (known after apply)
      ~ option_group_name                     = "default:mysql-8-4" -> (known after apply)
      ~ parameter_group_name                  = "default.mysql8.4" -> (known after apply)
      + performance_insights_kms_key_id       = (known after apply)
      ~ performance_insights_retention_period = 0 -> (known after apply)
      ~ port                                  = 3306 -> (known after apply)
      + replica_mode                          = (known after apply)
      ~ replicas                              = [] -> (known after apply)
      ~ resource_id                           = "db-M2U3ECYUAVWMT64S6KKBDCRQPA" -> (known after apply)
      ~ skip_final_snapshot                   = true -> false
      + snapshot_identifier                   = (known after apply)
      ~ status                                = "available" -> (known after apply)
      ~ storage_encrypted                     = false -> true # forces replacement
      ~ storage_throughput                    = 0 -> (known after apply)
      ~ storage_type                          = "gp2" -> (known after apply)
      - tags                                  = {} -> null
      + timezone                              = (known after apply)
      ~ upgrade_rollout_order                 = "second" -> (known after apply)
        # (27 unchanged attributes hidden)
    }

  # aws_ecs_task_definition.mysql_admin must be replaced
-/+ resource "aws_ecs_task_definition" "mysql_admin" {
      ~ arn                      = "arn:aws:ecs:us-east-2:628639830692:task-definition/azerothcore-mysql-admin:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-2:628639830692:task-definition/azerothcore-mysql-admin" -> (known after apply)
      ~ container_definitions    = jsonencode(
            [
              - {
                  - command               = [
                      - "mysql --host=\"$DB_HOST\" --user=\"$DB_USER\" \"$DB_NAME\" -e \"$SQL\"",
                    ]
                  - entryPoint            = [
                      - "sh",
                      - "-lc",
                    ]
                  - environment           = [
                      - {
                          - name  = "DB_HOST"
                          - value = "azerothcore-mysql.creesw04kf8v.us-east-2.rds.amazonaws.com"
                        },
                      - {
                          - name  = "DB_NAME"
                          - value = "acore_auth"
                        },
                      - {
                          - name  = "DB_USER"
                          - value = "acore"
                        },
                      - {
                          - name  = "SQL"
                          - value = "SELECT 1;"
                        },
                    ]
                  - essential             = true
                  - image                 = "mysql:8.4"
                  - logConfiguration      = {
                      - logDriver = "awslogs"
                      - options   = {
                          - awslogs-group         = "/ecs/azerothcore/mysql-admin"
                          - awslogs-region        = "us-east-2"
                          - awslogs-stream-prefix = "mysql-admin"
                        }
                    }
                  - mountPoints           = []
                  - name                  = "mysql-admin"
                  - portMappings          = []
                  - repositoryCredentials = {
                      - credentialsParameter = "arn:aws:secretsmanager:us-east-2:628639830692:secret:azerothcore-docker-registry-credentials-be9JyO"
                    }
                  - secrets               = [
                      - {
                          - name      = "MYSQL_PWD"
                          - valueFrom = "arn:aws:secretsmanager:us-east-2:628639830692:secret:azerothcore-db-credentials-VkU5uq:password::"
                        },
                    ]
                  - systemControls        = []
                  - volumesFrom           = []
                },
            ]
        ) -> (known after apply) # forces replacement
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "azerothcore-mysql-admin" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        # (13 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.db must be replaced
-/+ resource "aws_secretsmanager_secret_version" "db" {
      ~ arn                  = "arn:aws:secretsmanager:us-east-2:628639830692:secret:azerothcore-db-credentials-VkU5uq" -> (known after apply)
      + has_secret_string_wo = (known after apply)
      ~ id                   = "arn:aws:secretsmanager:us-east-2:628639830692:secret:azerothcore-db-credentials-VkU5uq|terraform-20260311203052588200000001" -> (known after apply)
      ~ secret_string        = (sensitive value) # forces replacement
      ~ version_id           = "terraform-20260311203052588200000001" -> (known after apply)
      ~ version_stages       = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 3 to add, 0 to change, 3 to destroy.

Changes to Outputs:
  ~ mysql_admin_task_definition_arn         = "arn:aws:ecs:us-east-2:628639830692:task-definition/azerothcore-mysql-admin:2" -> (known after apply)
  ~ rds_endpoint                            = "azerothcore-mysql.creesw04kf8v.us-east-2.rds.amazonaws.com" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @thekbb, Action: `pull_request`*